{"url":"https://www.quantstart.com/articles/","title":"Articles","content":"Tutorials, guides and lessons on quantitative finance and systematic trading topics\n\nGenerating Synthetic Equity Data with Realistic Correlation Structure\n\nLinear Regression: An Introduction\n\nBatch Linear Regression via Bayesian Estimation\n\nLinear Congruential Generators in Python\n\nVasicek Model Simulation with Python\n\nOrnstein-Uhlenbeck Simulation with Python\n\nPython Libraries for Quantitative Trading\n\nQSTrader v0.3.0 Released\n\nMomentum Top N with Docker, Jupyter and QSTrader\n\nCreating a Backtesting environment with Docker, Jupyter Notebook and QSTrader.\n\nQSTrader v0.2.6 Released\n\nBrownian Motion Simulation with Python\n\nCalculating Realised Volatility with Polygon Forex data\n\nCreating a Returns Series with Polygon's Forex Data\n\nCandlestick Subplots with Plotly and the AlphaVantage API\n\nQSTrader Fee Model Class Hierarchy\n\nQSTrader Asset Class Hierarchy\n\nBuilding a Raspberry Pi Cluster for QSTrader Using SLURM - Part 5\n\nBuilding a Raspberry Pi Cluster for QSTrader Using SLURM - Part 4\n\nGeometric Brownian Motion Simulation with Python\n\nBuilding a Raspberry Pi Cluster for QSTrader using SLURM - Part 3\n\nEvaluating Data Coverage with Tiingo\n\nBuilding a Raspberry Pi Cluster for QSTrader using SLURM - Part 2\n\nAn Introduction to Stooq Pricing Data\n\nCreating an Algorithmic Trading Prototyping Environment with Jupyter Notebooks and Plotly\n\nInstalling an Algorithmic Trading Research Environment with Python on Linux\n\nInstalling an Algorithmic Trading Research Environment with Python on Mac\n\nInstalling an Algorithmic Trading Research Environment with Python on Windows\n\nUnderstanding Equities Data\n\nBuilding a Raspberry Pi Cluster for QSTrader using SLURM - Part 1\n\nSimple versus Advanced Systematic Trading Strategies - Which is Better?\n\nQuantStart News - August 2020\n\nQSTrader: Documentation Released\n\nSigma Algebras and Probability Spaces\n\nTraining the Perceptron with Scikit-Learn and TensorFlow\n\nQuantStart News - July 2020\n\nConnecting to the Interactive Brokers Native Python API\n\nIntroduction to Artificial Neural Networks and the Perceptron\n\nInstalling TensorFlow 2.2 on Ubuntu 18.04 with an Nvidia GPU\n\nQuantStart News - June 2020\n\nQSTrader: v0.1.1 Released\n\nPeriodically Rebalanced Static Allocation 'Buy and Hold' Strategies in QSTrader\n\nQSTrader: v0.1.0 Released\n\nQuantStart Content Survey 2020\n\nMatrix Inversion - Linear Algebra for Deep Learning (Part 3)\n\nHow to Learn Advanced Mathematics Without Heading to University - Part 4\n\nGenerating Synthetic Histories for Backtesting Tactical Asset Allocation Strategies\n\nThe 60/40 Benchmark Portfolio\n\nSystematic Tactical Asset Allocation: An Introduction\n\nHiring a Software Developer to Code Up a Trading Strategy\n\nEngineering To Quant Finance - How To Make The Transition\n\nInstalling TensorFlow on Ubuntu 16.04 with an Nvidia GPU\n\nQSTrader: November 2017 Update\n\nQSTrader: A Major Update On Our Progress\n\nCapital Raising for Early Stage Quant Fund Managers - Part I\n\nHigh Frequency Trading III: Optimal Execution\n\nHigh Frequency Trading II: Limit Order Book\n\nBest Operating System For Quant Trading?\n\nHigh Frequency Trading I: Introduction to Market Microstructure\n\nWhat Alternative Career Paths Exist For Quants?\n\nDerivatives Pricing III: Models driven by Lévy processes\n\nDerivatives Pricing II: Volatility Is Rough\n\nBacktesting Systematic Trading Strategies in Python: Considerations and Open Source Frameworks\n\nDerivatives Pricing I: Pricing under the Black-Scholes model\n\nShould You Buy or Rent a GPU-Based Deep Learning Machine for Quant Trading Research?\n\nMatrix Algebra - Linear Algebra for Deep Learning (Part 2)\n\nRough Path Theory and Signatures Applied To Quantitative Finance - Part 4\n\nScalars, Vectors, Matrices and Tensors - Linear Algebra for Deep Learning (Part 1)\n\nRough Path Theory and Signatures Applied To Quantitative Finance - Part 3\n\nWhat are the Different Types of Quant Funds?\n\nRough Path Theory and Signatures Applied To Quantitative Finance - Part 2\n\nSetting up an Algorithmic Trading Business\n\nRough Path Theory and Signatures Applied To Quantitative Finance - Part 1\n\nWhat are the Career Paths in Systematic Trading?\n\nWhat is Deep Learning?\n\nQuantStart Upcoming Content Survey 2017\n\nMarket Regime Detection using Hidden Markov Models in QSTrader\n\nAnnualised Rolling Sharpe Ratio in QSTrader\n\nAdvanced Algorithmic Trading - Final Release\n\nSentiment Analysis Trading Strategy via Sentdex Data in QSTrader\n\nAluminum Smelting Cointegration Strategy in QSTrader\n\nAdvanced Algorithmic Trading and QSTrader - Fifth Update\n\nK-Means Clustering of Daily OHLC Bar Data\n\nBootstrap Aggregation, Random Forests and Boosted Trees\n\nBlack Friday Weekend - 40% Discount On All Ebooks!\n\nQuantStart Singapore November 2016 Trip Report\n\nQuantStart Gets a Makeover\n\nAdvanced Algorithmic Trading and QSTrader - Fourth Update\n\nStrategic and Equal Weighted ETF Portfolios in QSTrader\n\nMonthly Rebalancing of ETFs with Fixed Initial Weights in QSTrader\n\nQuantStart New York City October 2016 Trip Report\n\nQuantStart Events in October and November 2016\n\nHidden Markov Models for Regime Detection using R\n\nKalman Filter-Based Pairs Trading Strategy In QSTrader\n\nQuant Finance Career Skills - What Are Employers Looking For?\n\nHidden Markov Models - An Introduction\n\nHow to Learn Advanced Mathematics Without Heading to University - Part 3\n\nDynamic Hedge Ratio Between ETF Pairs Using the Kalman Filter\n\nBeginner's Guide to Decision Trees for Supervised Machine Learning\n\nShould You Build Your Own Backtester?\n\nMaximum Likelihood Estimation for Linear Regression\n\nMailbag: How Do You Move From Quant Developer To Quant Trader?\n\nBeginner's Guide to Unsupervised Learning\n\nMailbag: Can You Get A Job In HFT Without A Degree?\n\nAdvanced Algorithmic Trading and QSTrader - Second Update\n\nJohansen Test for Cointegrating Time Series Analysis in R\n\nCointegrated Augmented Dickey Fuller Test for Pairs Trading Evaluation in R\n\nCointegrated Time Series Analysis for Mean Reversion Trading with R\n\nDeep Learning with Theano - Part 1: Logistic Regression\n\nHow to Learn Advanced Mathematics Without Heading to University - Part 2\n\nAdvanced Algorithmic Trading and QSTrader Updates\n\nQuantStart April 2016 News\n\nBayesian Linear Regression Models with PyMC3\n\nMarkov Chain Monte Carlo for Bayesian Inference - The Metropolis Algorithm\n\nHow to Learn Advanced Mathematics Without Heading to University - Part 1\n\nCareers in Quantitative Finance\n\nAdvanced Trading Infrastructure - Portfolio Handler Class\n\nAdvanced Trading Infrastructure - Portfolio Class\n\nAdvanced Trading Infrastructure - Position Class\n\nQuantStart: 2015 In Review\n\nState Space Models and the Kalman Filter\n\nAnnouncing the QuantStart Advanced Trading Infrastructure Article Series\n\nHow to Write a Great Quant Blog\n\nAnnouncement: Speaking at QuantCon in April 2016\n\nARIMA+GARCH Trading Strategy on the S&P500 Stock Market Index Using R\n\nGeneralised Autoregressive Conditional Heteroskedasticity GARCH(p, q) Models for Time Series Analysis\n\nAutoregressive Integrated Moving Average ARIMA(p, d, q) Models for Time Series Analysis\n\nAutoregressive Moving Average ARMA(p, q) Models for Time Series Analysis - Part 3\n\nAutoregressive Moving Average ARMA(p, q) Models for Time Series Analysis - Part 2\n\nAutoregressive Moving Average ARMA(p, q) Models for Time Series Analysis - Part 1\n\nWhite Noise and Random Walks in Time Series Analysis\n\nSerial Correlation in Time Series Analysis\n\nForex Trading Diary #7 - New Backtest Interface\n\nBeginner's Guide to Time Series Analysis\n\nSuccessful Algorithmic Trading Updated for Python 2.7.x and Python 3.4.x\n\nForex Trading Diary #6 - Multi-Day Trading and Plotting Results\n\nBayesian Inference of a Binomial Proportion - The Analytical Approach\n\nThe Top 5 UK Universities For Becoming A Quant\n\nForex Trading Diary #5 - Trading Multiple Currency Pairs\n\nForex Trading Diary #4 - Adding a Backtesting Capability\n\nMatrix-Matrix Multiplication on the GPU with Nvidia CUDA\n\nBest Undergraduate Degree Course For Becoming A Quant?\n\nUsing Cross-Validation to Optimise a Machine Learning Method - The Regression Setting\n\nForex Trading Diary #3 - Open Sourcing the Forex Trading System\n\nThe Bias-Variance Tradeoff in Statistical Machine Learning - The Regression Setting\n\nForex Trading Diary #2 - Adding a Portfolio to the OANDA Automated Trading System\n\nForex Trading Diary #1 - Automated Forex Trading with the OANDA API\n\nSupervised Learning for Document Classification with Scikit-Learn\n\nQuantStart: 2014 in Review\n\nMonte Carlo Simulations In CUDA - Barrier Option Pricing\n\nBayesian Statistics: A Beginner's Guide\n\ndev_array: A Useful Array Class for CUDA\n\nInstalling Nvidia CUDA on Ubuntu 14.04 for Linux GPU Computing\n\nEvent-Driven Backtesting with Python - Part VIII\n\nSupport Vector Machines: A Guide for Beginners\n\nVector Addition \"Hello World!\" Example with CUDA on Mac OSX\n\nInstalling Nvidia CUDA on Mac OSX for GPU-Based Parallel Computing\n\nEasy Multi-Platform Installation of a Scientific Python Stack Using Anaconda\n\nBasics of Statistical Mean Reversion Testing - Part II\n\nValue at Risk (VaR) for Algorithmic Trading Risk Management - Part I\n\nA Day in the Life of a Quantitative Developer\n\nHow To Get A Quant Job Once You Have A PhD\n\nTop 5 Essential Books for Python Machine Learning\n\nMoney Management via the Kelly Criterion\n\nQuick-Start Python Quantitative Research Environment on Ubuntu 14.04\n\nParallelising Python with Threading and Multiprocessing\n\nEvent-Driven Backtesting with Python - Part VII\n\nBeginner's Guide to Statistical Machine Learning - Part I\n\nEvent-Driven Backtesting with Python - Part VI\n\nEvent-Driven Backtesting with Python - Part V\n\nEvent-Driven Backtesting with Python - Part IV\n\nMy Talk At The London Financial Python User Group\n\nEvent-Driven Backtesting with Python - Part III\n\nDownloading Historical Intraday US Equities From DTN IQFeed with Python\n\nEvent-Driven Backtesting with Python - Part II\n\nEvent-Driven Backtesting with Python - Part I\n\nChoosing a Platform for Backtesting and Automated Execution\n\nBacktesting An Intraday Mean Reversion Pairs Strategy Between SPY And IWM\n\nUsing Python, IBPy and the Interactive Brokers API to Automate Trades\n\nContinuous Futures Contracts for Backtesting Purposes\n\nBacktesting a Forecasting Strategy for the S&P500 in Python with pandas\n\nBacktesting a Moving Average Crossover in Python with pandas\n\nResearch Backtesting Environments in Python with pandas\n\nForecasting Financial Time Series - Part I\n\nSelf-Study Plan for Becoming a Quantitative Trader - Part II\n\nDownloading Historical Futures Data From Quandl\n\nMy Interview Over At OneStepRemoved.com\n\nWhy a Masters in Finance Won't Make You a Quant Trader\n\nSelf-Study Plan for Becoming a Quantitative Trader - Part I\n\nHow to Get a Job at a High Frequency Trading Firm\n\nBasics of Statistical Mean Reversion Testing\n\nInstalling a Desktop Algorithmic Trading Research Environment using Ubuntu Linux and Python\n\nCalculating the Greeks with Finite Difference and Monte Carlo Methods in C++\n\nJump-Diffusion Models for European Options Pricing in C++\n\nGetting a Job in a Top Tier Quant Hedge Fund\n\nHeston Stochastic Volatility Model with Euler Discretisation in C++\n\nFree Quantitative Finance Resources\n\nImplied Volatility in C++ using Template Functions and Newton-Raphson\n\nEigen Library for Matrix Algebra in C++\n\nWhat's New in the C++11 Standard Template Library?\n\nBest Programming Language for Algorithmic Trading Systems?\n\nC++ Standard Template Library Part III - Algorithms\n\nTop 10 Essential Resources for Learning Financial Econometrics\n\nInteractive Brokers Demo Account Signup Tutorial\n\nGenerating Correlated Asset Paths in C++ via Monte Carlo\n\nImplied Volatility in C++ using Template Functions and Interval Bisection\n\nTop 5 Essential Beginner Books for Algorithmic Trading\n\nSharpe Ratio for Algorithmic Trading Performance Measurement\n\nC++ Standard Template Library Part II - Iterators\n\nSecurities Master Database with MySQL and Python\n\nSecurities Master Databases for Algorithmic Trading\n\nC++ Explicit Euler Finite Difference Method for Black Scholes\n\nSuccessful Backtesting of Algorithmic Trading Strategies - Part II\n\nCan Algorithmic Traders Still Succeed at the Retail Level?\n\nSuccessful Backtesting of Algorithmic Trading Strategies - Part I\n\nHow to Identify Algorithmic Trading Strategies\n\nRandom Number Generation via Linear Congruential Generators in C++\n\nFunction Objects (\"Functors\") in C++ - Part 1\n\nStatistical Distributions in C++\n\nFloating Strike Lookback Option Pricing with C++ via Analytic Formulae\n\nBeginner's Guide to Quantitative Trading\n\nRisk Neutral Pricing of a Call Option with Binomial Trees with Non-Zero Interest Rates\n\nSelf-Study Plan for Becoming a Quantitative Analyst\n\nAsian option pricing with C++ via Monte Carlo Methods\n\nSelf-Study Plan for Becoming a Quantitative Developer\n\nCan You Still Become a Quant in Your Thirties?\n\nC++ Standard Template Library Part I - Containers\n\nMatrix Classes in C++ - The Source File\n\nMatrix Classes in C++ - The Header File\n\nTridiagonal Matrix Algorithm (\"Thomas Algorithm\") in C++\n\nDouble digital option pricing with C++ via Monte Carlo methods\n\nDigital option pricing with C++ via Monte Carlo methods\n\nEuropean vanilla option pricing with C++ via Monte Carlo methods\n\nEuropean vanilla option pricing with C++ and analytic formulae\n\nJacobi Method in Python and NumPy\n\nQR Decomposition with Python and NumPy\n\nCholesky Decomposition in Python and NumPy\n\nLU Decomposition in Python and NumPy\n\nSTL Containers and Auto_ptrs - Why They Don't Mix\n\nWhich Programming Language Should You Learn To Get A Quant Developer Job?\n\nMathematical Constants in C++\n\nMy Experiences as a Quantitative Developer in a Hedge Fund\n\nPassing By Reference To Const in C++\n\nWhy Study for a Mathematical Finance PhD?\n\nWhat Classes Should You Take To Become a Quantitative Analyst?\n\nC++ Virtual Destructors: How to Avoid Memory Leaks\n\nWhat are the Different Types of Quantitative Analysts?\n\nQuantitative Finance Reading List\n\nDerivative Pricing with a Normal Model via a Multi-Step Binomial Tree\n\nPricing a Call Option with Multi-Step Binomial Trees\n\nPricing a Call Option with Two Time-Step Binomial Trees\n\nMultinomial Trees and Incomplete Markets\n\nReplication Pricing of a Call Option with a One-Step Binomial Tree\n\nRisk Neutral Pricing of a Call Option with a Two-State Tree\n\nHedging the sale of a Call Option with a Two-State Tree\n\nIntroduction to Option Pricing with Binomial Trees\n\nUnderstanding How to Become a Quantitative Analyst\n\nTop 5 Essential Beginner C++ Books for Financial Engineers\n\nTop 5 Finite Difference Methods books for Quant Analysts\n\n5 Top Books for Acing a Quantitative Analyst Interview\n\n5 Important But Not So Common Books A Quant Should Read Before Applying for a Job\n\nEuropean Vanilla Call-Put Option Pricing with Python\n\nOptions Pricing in Python\n\nTridiagonal Matrix Solver via Thomas Algorithm\n\nCrank-Nicholson Implicit Scheme\n\nSolving the Diffusion Equation Explicitly\n\nDerivative Approximation via Finite Difference Methods\n\nJunior Quant Jobs Beginning a career in Financial Engineering after a PhD\n\nDeriving the Black-Scholes Equation\n\nIto's Lemma\n\nGeometric Brownian Motion\n\nStochastic Differential Equations\n\nBrownian Motion and the Wiener Process\n\nQuant Reading List Python Programming\n\nQuant Reading List Numerical Methods\n\nQuant Reading List C++ Programming\n\nQuant Reading List Derivative Pricing\n\nThe Markov and Martingale Properties\n\nIntroduction to Stochastic Calculus","content_length":15422,"quality_score":50.0,"keywords":["tutorials","traders","qstrader","trading","simulations"],"strategy_keywords":["sharpe ratio","moving average","moving average","moving average","moving average","moving average","sharpe ratio"],"readability_score":-21.745522443313263,"tags":["implementation","strategy","tutorial"]}
